In [ ]:
# 데이터의 병합
# 1. 속성 값을 추가하는 경우
# 2. 동일한 컬럼 데이터를 합치는 경우(Database의 Union과 같은 개념)

1. Join 함수

In [1]:
import pandas as pd

In [15]:
joinMaster = pd.read_csv("../../stdcode6/dataset/join_region_master.csv", encoding = 'ms949')

In [16]:
joinMaster

  REGIONID REGIONNAME
0      A01         한국
1      A02         미국
2      A03        프랑스
3      A04         독일

In [8]:
volDf = pd.read_csv("../../stdcode6/dataset/join_kopo_product_volume.csv")

In [17]:
volDf

  REGIONID PRODUCT  YEARWEEK   QTY
0      A01  ST0001    201901  3000
1      A01  ST0001    201902  3500
2      A02  ST0002    201901  4000
3      A02  ST0003    201902  7000

In [24]:
mergeResult = pd.merge(left=joinMaster,
                       right=volDf,
                       left_on="REGIONID",
                       right_on="REGIONID",
                       how="inner")\
[["REGIONID", "REGIONNAME", "PRODUCT", "YEARWEEK", "QTY"]]

In [25]:
mergeResult

  REGIONID REGIONNAME PRODUCT  YEARWEEK   QTY
0      A01         한국  ST0001    201901  3000
1      A01         한국  ST0001    201902  3500
2      A02         미국  ST0002    201901  4000
3      A02         미국  ST0003    201902  7000